# BuiltInFailures.SlabFailures Class

---
Failures about Slab.
SystemObject Autodesk.Revit.DBBuiltInFailuresSlabFailures
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public static class SlabFailures

    Public NotInheritable Class SlabFailures

    public ref class SlabFailures abstract sealed

    [<AbstractClassAttribute>]
    [<SealedAttribute>]
    type SlabFailures = class end
The BuiltInFailuresSlabFailures type exposes the following members.
| Name| Description
---|---|---
| CantileverValueTooBig|  Cantilever value is too big.
Top
#### Reference
Autodesk.Revit.DB Namespace